In [5]:
import numpy as np
import pandas as pd

In [7]:
dict1={
       "name"  : ['harry','mini','sofia','us'],
       "marks" : [30,53,87,76],
       "add" : ['India','argentina','finland','france']
        }

In [17]:
df=pd.DataFrame(dict1)

In [18]:
df

    name  marks        add
0  harry     30      India
1   mini     53  argentina
2  sofia     87    finland
3     us     76     france

In [11]:
df.to_csv('report.csv')

In [14]:
df.to_csv('report_index_false.csv',index=False)

In [15]:
df.head(2)

    name  marks        add
0  harry     30      India
1   mini     53  argentina

In [16]:
df.tail(3)

    name  marks        add
1   mini     53  argentina
2  sofia     87    finland
3     us     76     france

In [19]:
df.describe()

          marks
count   4.00000
mean   61.50000
std    25.33114
min    30.00000
25%    47.25000
50%    64.50000
75%    78.75000
max    87.00000

In [27]:
p=pd.read_csv('p.csv')

In [28]:
p

   trainno  speed        add
0      123     30      India
1       44     53  argentina
2      245     87    finland
3     3535     56     france

In [31]:
p['speed'][0]=70

C:\Users\Dell\anaconda3\lib\site-packages\ipykernel_launcher.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  """Entry point for launching an IPython kernel.

In [32]:
p

   trainno  speed        add
0      123     70      India
1       44     53  argentina
2      245     87    finland
3     3535     56     france